ADDRESS_ERROR_MESSAGE = '''
Адрес кошелька введен некорректно! Введи ровно...
'''

APROVED = '''
✅️ Поздравляю! Ваш доступ одобрен! Теперь Вы можете продолжить обмен своих BYN на мои BTC или создать новую заявку, начав сначала!
'''

BALANCE_BIT_MESSAGE = '''
К сожалению, запрашиваемая Вами сумма биткоинов отсутствует. 
Обратитесь к @RooK5555
'''

BALANCE_BYN_MESSAGE = '''
К сожалению, на Вашу сумму денег количество биткоинов отсутствует. 
Обратитесь к @RooK5555
'''

BLACK_LIST = '''
Извините! Вы внесены в "черный список" как злостный нарушитель правил. Обратитесь к @RooK5555.
'''

BOT_TURN_ON_ADMIN = '''
✅ Бот включен.
'''

BOT_TURN_OFF = '''
К сожалению, на данный момент бот выключен администратором. Обратитесь к @RooK5555.
'''

BOT_TURN_OFF_ADMIN = '''
❌ Бот выключен. \n
Внимание! Если зарегистрированный пользователь сейчас совершает покупку, Вам может прийти сообщение об оплате!
'''

CHECK_ERROR_CONNECT_TO_EMAIL = '''
Транзакция отменена! 
НЕТ ВОЗМОЖНОСТИ ПРОВЕРИТЬ сообщения от банка! 
Обратитесь к @RooK5555
'''

CHECK_ERROR_MESSAGE_FROM_BANK = '''
Транзакция отменена! 
ЧЕК подтверждения перевода от банка НЕ ПОСТУПИЛ! 
Обратитесь к @RooK5555
'''

CANCEL_MESSAGE = '''
Действие отменено! Чтобы создать новую заявку на обмен нажмите кнопку ниже.
'''

CHOISE_RATE_MESSAGE = '''
Выберите валюту, удобную для дальнейшего расчета.
'''

DECLINED = '''
К сожалению, Вам отклонен доступ к покупке ВТС. По вопросам обратитесь к @RooK5555
'''

ENTER_ADDRESS_MESSAGE = '''
Введите адрес BTC (Кош):
'''

ERROR_LOOP = '''
Error in transaction loop!\nТранзакция отменена!\nПожалуйста, обратитесь к @RooK5555, сообщив ему эту ошибку.
'''

ERROR_NOTIFICATION = '''
Error in notification!\nИмеется замечание для админа!\nПожалуйста, обратитесь к @RooK5555, сообщив ему эту ошибку.
'''

ERROR_PARSER = '''
Parser error!\nТранзакция отменена!\nПожалуйста, обратитесь к @RooK5555, сообщив ему эту ошибку.
'''

ERROR_SENDER = '''
Sender error!\nТранзакция отменена!\nПожалуйста, обратитесь к @RooK5555, сообщив ему эту ошибку.
'''

ERROR_YANDEX = '''
Yandex error!\nТранзакция отменена!\nПожалуйста, обратитесь к @RooK5555, сообщив ему эту ошибку.
'''

GET_APLICATION = '''
✅️ Отследить транзакцию можно по ссылке:  
'''

MESSAGE_FOR_APPLY = '''
Чтобы приобрести ВТС необходимо запросить доступ у администратора на включение Вас в группу.  
'''

TERMS_MESSAGE = '''
Перед тем, как приступить к сделке, Вы должны прочесть и согласиться co следующими пунктами:
1. BTC приобретаются для личных целей; 
2. Приобретение  BTC не связано с противоправной деятельностью;
3. Платежи от 3 лиц запрещены. Платёж совершается 1 зачисление. Бот не увидит 2 разных чека и btc отправлены не будут;
4. Копии чеков об оплате могут быть переданы для анализа, при запросе со стороны банковского регулятора, либо правоохранительных органов Республики Беларусь;
5. Ответственность за несоблюдение данных правил и установленного законодательства Республики Беларусь ложится исключительно на Вас.
'''

REJECT_TRANSACTION = '''
Транзакция отменена администратором! Пожалуйста, обратитесь к @RooK5555.
'''

REQUISITERS_ERROR_MESSAGE = '''
🔴 Реквизиты введены некорректно! Вводить нужно только текстовые сообщения!
'''

REQUISITERS_SUCCESSFULLY = '''
🟢 ⬆️ Реквизиты успешно установлены!
'''

SETTING = '''
Выберите, что будем изменять...
'''

SERVER_ERROR = '''
Заявка отклонена! Не по нашим причинам произошел технический сбой подключения к серверу.
Повтори попытку позже либо свяжись с @RooK5555
'''

STATUS_WAIT_MESSAGE = '''
⏳ Ваша заявка принята. Если оплата прошла успешно, BTC будут отправлены в течение 10 минут. 
Обязательно сохраняйте оригинал чека до поступления BTC. Пожалуйста, ожидайте...
'''

STOP_BOT_SERVER_ATTENTION = '''
⚠️ ВНИМАНИЕ! ⚠️\n
Вы собираетесь отключить бот на сервере. Запуск бота возможен только ч/з командную строку.
Вы уверены, что желаете отключить бот? 
'''

STOP_BOT_SERVER = '''
🚫 Приложение остановлено. 🚫
'''

TEXT_FOR_REQUISITERS = '''
⬇️ На текущий момент установлены следующие реквизиты:
'''

TEXT_FOR_REMINDER = '''
Введите реквизиты:
'''

UPLOAD_PHOTO_MESSAGE = '''
Загрузите фото/скрин чека, подтверждающий оплату.
'''

UPLOAD_ERROR_MESSAGE = '''
Фотография не найдена в сообщении! Отправь фотографию...
'''

UPLOAD_OK_MESSAGE = '''
Фотография успешно загружена! Нажмите "OK".
'''

USERNAME_MISSING = '''
У Вас отсутствует username! Пожалуйста, создайте его и повторите попытку снова. 
Если что-то не получается, обратитесь к @RooK5555.
'''

WAIT_10_MINUTES = '''
Прошло 10 минут. Администратору еще не удалось проверить Вашу оплату. Просьба обратиться к @RooK5555 и ожидать проверку оплаты...
'''

WAIT_24_HOURS = '''
Транзакция прервана! Прошло 24 часа. Администратору не удалось проверить Вашу оплату. Для уточнения деталей обратитесь к @RooK5555
'''

WAIT_APPROVE = '''
⏳ Ваш запрос на доступ принят. Пожалуйста, ожидайте ответ или свяжитесь самостоятельно с администратором: @RooK5555
'''

WAIT_REPEATED_APPROVE = '''
⏳ Вы уже отправили запрос на доступ. Пожалуйста, ожидайте ответ...
'''

WELCOME_ADMIN_TURN_ON = '''
Вы вошли как администратор.\n
Состояние бота: ✅ ВКЛЮЧЕН 
'''

WELCOME_ADMIN_TURN_OFF = '''
Вы вошли как администратор.\n
Состояние бота: ❌ ВЫКЛЮЧЕН 
'''

WELCOME_MESSAGE = '''
Привет! Вы запустили Бот, который готов продать Вам личные BTC владельца @RooK5555 за BYN. Бот работает круглосуточно.
'''
