ADDRESS_ERROR_MESSAGE = '''
Адрес кошелька введен некорректно! Введи ровно...
'''

APROVED = '''
✅️ Поздравляю! Ваш доступ одобрен! Теперь Вы можете продолжить обмен BYN на криптовалюту или создать новую заявку, начав сначала!
'''

AUTOMATIC_CHECK_TRANSACTION = '''
✅️ В сети блокчейн Ваша транзакция подтверждена!
'''

AUTOMATIC_CHECK_TRANSACTION_1_HOUR = '''
⚠️ Подтверждение Вашей транзакции заняло много времени, просьба, проверять вручную. Спасибо!
'''

BALANCE_BIT_MESSAGE = '''
К сожалению, запрашиваемая Вами сумма биткоинов отсутствует. 
Обратитесь к @RooK5555
'''

BALANCE_BYN_MESSAGE = '''
К сожалению, на Вашу сумму денег количество биткоинов отсутствует. 
Обратитесь к @RooK5555
'''

BALANCE_USDT_MESSAGE = '''
К сожалению, запрашиваемая Вами сумма USDT (trc20) отсутствует. 
Обратитесь к @RooK5555
'''

BALANCE_XMR_MESSAGE = '''
К сожалению, запрашиваемая Вами сумма XMR (Monero) отсутствует. 
Обратитесь к @RooK5555
'''

BANK_NAME_SUCCESSFULLY = '''
✔️ Название банка успешно измененно!\nТекущий банк:\n<B>{}</B>
'''

BLACK_LIST = '''
Извините! Вы внесены в "черный список" как злостный нарушитель правил. Обратитесь к @RooK5555.
'''

BOT_TURN_ON_ADMIN = '''
✅ Бот включен.
'''

BOT_TURN_ON_BTC = '''
✅ Обмен ВТС включен!
'''

BOT_TURN_OFF = '''
К сожалению, на данный момент бот выключен администратором. Обратитесь к @RooK5555.
'''

BOT_TURN_OFF_ADMIN = '''
❌ Бот выключен. \n
Внимание! Если зарегистрированный пользователь сейчас совершает покупку, Вам может прийти сообщение об оплате!
'''

BOT_TURN_OFF_BTC = '''
❌ Обмен ВТС выключен. \n
Внимание! Если зарегистрированный пользователь сейчас совершает покупку ВТС, Вам может прийти сообщение об оплате!
'''

CHECK_ERROR_CONNECT_TO_EMAIL = '''
Транзакция отменена! 
НЕТ ВОЗМОЖНОСТИ ПРОВЕРИТЬ сообщения от банка! 
Обратитесь к @RooK5555
'''

CHECK_ERROR_MESSAGE_FROM_BANK = '''
Транзакция отменена! 
ЧЕК подтверждения перевода от банка НЕ ПОСТУПИЛ! 
Обратитесь к @RooK5555
'''

CANCEL_MESSAGE = '''
Действие отменено! Чтобы создать новую заявку на обмен нажмите кнопку ниже.
'''

CHOISE_RATE_MESSAGE = '''
Выберите криптовалюту, которую желаете приобрести.
'''

CHOISE_RATE_MESSAGE_BTC_HIDDEN = '''
Выберите криптовалюту, которую желаете приобрести.\
\n(Обмен <B>ВТС</B> через бот временно отключен. Нужен ВТС, обратитесь к @RooK5555)
'''

CHOISE_RATE_MESSAG_COIN = '''
Выберите валюту, удобную для дальнейшего расчета.
'''

COST_BTC = '''
За указанное количество BTC я бы хотел получить <B>{}</B> BYN. Я сейчас поставлю максимальную комиссию на отправку и биткоин отправится с ПРИОРИТЕТОМ. ⏳ Время на оплату: <U>15 минут.</U> Продолжить?
'''

COST_BYN = '''
Вам будет отправлено <B>{}</B> BTC. Я сейчас поставлю максимальную комиссию на отправку и биткоин отправится с ПРИОРИТЕТОМ. ⏳ Время на оплату: <U>15 минут.</U> Продолжить?
'''

COST_BYN_USDT = '''
Вам будет отправлено <B>{}</B> USDT (trc20). ⏳ Время на оплату: <U>15 минут.</U> Продолжить?
'''

COST_USDT = '''
За указанное количество USDT (trc20) я бы хотел получить <B>{}</B> BYN. ⏳ Время на оплату: <U>15 минут.</U> Продолжить?
'''

COST_XMR = '''
За указанное количество XMR (Monero) я бы хотел получить <B>{}</B> BYN. ⏳ Время на оплату: <U>15 минут.</U> Продолжить?
'''

DECLINED = '''
К сожалению, Вам отклонен доступ к покупке ВТС. По вопросам обратитесь к @RooK5555
'''

ENTER_ADDRESS_MESSAGE = '''
Введите адрес Вашего кошелька:
'''

ENTER_CORRECT_ID_USER = '''
Это не ID! Введите ID пользователя (только цифры!):
'''

ENTER_ID_USER = '''
Введите ID пользователя:
'''

ERROR_COUNT_BALANCE = '''
Balance calculation Error!\nИмеется замечание для админа!\nПожалуйста, обратитесь к @RooK5555, сообщив ему эту ошибку.
'''

ERROR_TOTAL_AMOUNT_LOYATY = '''
Total amount for loyaty Error!\n{}\nИмеется замечание для админа!\nПожалуйста, обратитесь к @RooK5555, сообщив ему эту ошибку.
'''

ERROR_LOOP = '''
Error in transaction loop!\nТранзакция отменена!\nПожалуйста, обратитесь к @RooK5555, сообщив ему эту ошибку.
'''

ERROR_MESSAGE_FOR_BANK_NAME = '''
🔴 Название банка введено некорректно! Вводить нужно только текстовое сообщение!
'''

ERROR_NOTIFICATION = '''
Error in notification!\nИмеется замечание для админа!\nПожалуйста, обратитесь к @RooK5555, сообщив ему эту ошибку.
'''

ERROR_PARSER = '''
Parser error!\nТранзакция отменена!\nПожалуйста, обратитесь к @RooK5555, сообщив ему эту ошибку.
'''

ERROR_SENDER = '''
Sender error!\nТранзакция отменена!\nПожалуйста, обратитесь к @RooK5555, сообщив ему эту ошибку.
'''

ERROR_YANDEX = '''
Yandex error!\nТранзакция отменена!\nПожалуйста, обратитесь к @RooK5555, сообщив ему эту ошибку.
'''

GET_APLICATION = '''
✅️ Отследить транзакцию можно по ссылке:  
'''

IS_ONLY_DAY = '''
Текущие реквизиты показывать с 08.00 до 21.00 ?
'''

MANUAL_CHECK_TRANSACTION = '''
⚠️ Подтверждение Вашей транзакции, просьба, проверять вручную. Спасибо!
'''

MESSAGE_FOR_APPLY = '''
Чтобы приобрести криптовалюту необходимо запросить доступ у администратора на включение Вас в группу.  
'''

NO_USERS_3_MONTH = '''
Общее количество пользователей в группе: {}.\nПользователей, не посещающих приложение больше 3-х месяцев, НЕТ.
'''

NOTIFICATION_ERROR_MESSAGE = '''
🔴 Сообщение введен некорректно! Вводить нужно только текстовые сообщения!
'''

NOTIFICATION_SUCCESSFULLY = '''
✅️ Сообщение успешно отправлено всем участникам!
'''

TERMS_MESSAGE = '''
Перед тем, как приступить к приобретению токенов криптовалюты биткоин, Вы должны прочесть и согласиться co следующими пунктами:
1. BTC, USDT(trc20) приобретаются для личных целей; 
2. Приобретение  BTC, USDT(trc20) не связано с противоправной и предпринимательской деятельностью;
3. Оплата от 3 лиц запрещены. Платёж совершается 1 зачисление. Два разных чека и отправки btc (usdt) не будут;
4. Копии чеков об оплате могут быть переданы для анализа, при запросе со стороны банковского регулятора, либо правоохранительных органов Республики Беларусь;
5. Ответственность за несоблюдение данных правил и установленного законодательства Республики Беларусь ложится исключительно на Вас.
'''

TEXT_FOR_BANK_THE_AMOUNT_ZERO = '''
Вы действительно желаете обнулить все суммы банков!
'''

TEXT_FOR_BANK_THE_AMOUNT_ZERO_SUCCESSFULLY = '''
Обнуление сумм прошло успешно! 
'''

THE_BANK_NAME_IS_EXISTS = '''
Текущее название банка - {}, уже существует!
'''

THE_MESSAGE_IS_TOO_LONG = '''
Текущее название банка слишком длинное! Число введенных символов {} из 30 допустимых!
'''

REJECT_TRANSACTION = '''
Транзакция отменена администратором! Пожалуйста, обратитесь к @RooK5555.
'''

REQUISITERS_ERROR_MESSAGE = '''
🔴 Реквизиты введены некорректно! Вводить нужно только текстовые сообщения!
'''

REQUISITERS_SUCCESSFULLY = '''
🟢 Реквизиты успешно установлены!\n🟢 0️⃣ Баланс для текущего банка ноль!
'''

REMOVE_REQUISITERS_SUCCESSFULLY = '''
🟢 Реквизиты банка {} успешно удалены!
'''

REMOVE_REQUISITERS_UNSUCCESSFULLY = '''
🔴 Текущий банк "{}" отсутствует в списке реквизитов!
'''

SETTING = '''
Выберите, что будем изменять...
'''

SERVER_ERROR = '''
Заявка отклонена! Не по нашим причинам произошел технический сбой подключения к серверу.
Повтори попытку позже либо свяжись с @RooK5555
'''

STATUS_MORE_15_MINUTES_MESSAGE = '''
⌛️ Лимит времени исчерпан! Время на операцию было отведено 15 минут! Если предложение еще актуально, пересоздайте заявку заново.
'''

STATUS_WAIT_MESSAGE = '''
⏳ Ваш платеж принят. Если банк подтвердит поступление денег, {} будут отправлены в течение 10 минут. 
Обязательно сохраняйте оригинал чека до поступления {}. Пожалуйста, ожидайте...
'''

STOP_BOT_SERVER_ATTENTION = '''
⚠️ ВНИМАНИЕ! ⚠️\n
Вы собираетесь отключить бот на сервере. Запуск бота возможен только ч/з командную строку.
Вы уверены, что желаете отключить бот? 
'''

STOP_BOT_SERVER = '''
🚫 Приложение остановлено. 🚫
'''

SUCCESSFULLY_DELETED_USER = '''
Пользователь ID № {} удален из группы.
'''

TEXT_FOR_NOTIFICATION = '''
Введите сообщение, которое будет отправлено всем зарегистрированным пользователям...
'''

TEXT_FOR_NOTIFICATION_START = '''
Здесь можно написать и отправить текстовое сообщение всем зарегистрированным пользователям.
'''

TEXT_FOR_REQUISITERS = '''
<B>Итого реквизитов: {} шт.</B>\nВнимание! Для пользователя будут выведены реквизиты банка с самой минимальной суммой сделки!
'''

TEXT_FOR_REQUISITERS_ONE_BANK = '''
\n\n<B>БАНК № {}\nНаименование: {}\nВсего: {} BYN\nРежим работы: {}</B>\n\n
⬇️ <B>ТЕКУЩИЕ РЕКВИЗИТЫ:</B>\n\n{}\n
'''

TEXT_FOR_BANK_NAME = '''
Введите название банка на АНГЛИЙСКОМ!:
'''

TEXT_FOR_REMINDER = '''
Введите реквизиты:
'''

TEXT_FOR_PRICE = '''
Итого к оплате: <b>{} BYN</b>
'''

TEXT_FOR_PRICE_LOYALTY = '''Итого к оплате: <b><s>{}</s> {} BYN</b>'''

TEXT_FOR_COUNT_COINS = '''Вам будет переведено  <b>{} {}</b>'''

TEXT_FOR_LOYALTY = '''<i><b>Бонусная программа!</b>\nНа Вашем счету накоплена сумма: {}р. Для получения {}% скидки на комиссию обмена, Вам необходимо накопить еще {}р. к Вашей сумме.</i>'''

TEXT_FOR_LOYALTY_ZERO = '''<i><b>Бонусная программа!</b>\nНа текущий момент у Вас нет накопленной суммы. Для получения 20% скидки на комиссию обмена, Вам необходимо накопить сумму обмена не менее 3000р.</i>'''

TEXT_FOR_LOYALTY_THANKS = '''<i><b>Бонусная программа!</b>\nНа Вашем счету накоплена сумма: {}р. У Вас 100% скидка на комиссию обмена! Спасибо, что доверяете мне!</i>'''

UPLOAD_PHOTO_MESSAGE = '''
Загрузите фото/скрин чека, подтверждающий оплату.
'''

UPLOAD_ERROR_MESSAGE = '''
Фотография не найдена в сообщении! Отправь фотографию...
'''

UPLOAD_OK_MESSAGE = '''
Фотография успешно загружена! Нажмите "OK".
'''

USER_DONT_EXISTS = '''
Пользователя ID № {} не существует в Вашей группе.
'''

USERS_MORE_3_MONTH = '''
Общее количество пользователей в группе: {}.\nСписок ID пользователей, не посещающих приложение больше 3-х месяцев:\n{}
'''

USERNAME_MISSING = '''
У Вас отсутствует username! Пожалуйста, создайте его и повторите попытку снова. 
Если что-то не получается, обратитесь к @RooK5555.
'''

WAIT_10_MINUTES = '''
Прошло 10 минут. Администратору еще не удалось проверить Вашу оплату. Просьба обратиться к @RooK5555 и ожидать проверку оплаты...
'''

WAIT_24_HOURS = '''
Транзакция прервана! Прошло 24 часа. Администратору не удалось проверить Вашу оплату. Для уточнения деталей обратитесь к @RooK5555
'''

WAIT_APPROVE = '''
⏳ Ваш запрос принят.  Пожалуйста, ожидайте ответ. Если ответа не поступит, то Вы может использовать бота для просмотра курса биткоина в любое удобное для вас время.
'''

WAIT_REPEATED_APPROVE = '''
⏳ Вы уже отправили запрос на доступ. Пожалуйста, ожидайте ответ...
'''

WELCOME_ADMIN_TURN_ON = '''
Вы вошли как администратор.\n
Состояние бота: ✅ ВКЛЮЧЕН 
'''

WELCOME_ADMIN_TURN_ON_BTC = '''
Обмен ВТС: ✅ ВКЛЮЧЕН \n
'''

WELCOME_ADMIN_TURN_OFF = '''
Вы вошли как администратор.\n
Состояние бота: ❌ ВЫКЛЮЧЕН 
'''

WELCOME_ADMIN_TURN_OFF_BTC = '''
Обмен ВТС: ❌ ВЫКЛЮЧЕН \n
'''

WELCOME_MESSAGE = '''
Привет! Если вы хотите приобрести за свои рубли BYN мою криптовалюту, то мы можем с вами обменяться в личных целях. Нажимайте продолжить.
'''
